# Taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Non-nixpkgs tools
brew "fish"
brew "mas"
brew "trash"

brew "rbenv"

# Development
cask "atom"
cask "dash"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "docker"
cask "java"  # required by dbeaver-community
cask "font-firacode-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"
cask "gitup"
cask "growlnotify"
cask "insomnia"
cask "iterm2"
cask "macvim"
cask "sublime-merge"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vimr"
cask "visual-studio-code"
cask "zerobranestudio"
mas "Xcode",                          id: 497799835

# Crypto
cask "electron-cash"
cask "electrum"

# Hardware hacking
cask "arduino"
cask "ultimaker-cura"
cask "freecad"
cask "meshmixer"
cask "meshlab"
cask "openscad-snapshot"
cask "prusaslicer"
mas "eDrawings",                      id: 1209754386

# Services from Homebrew
cask "markdown-service-tools"

# QuickLook plugins from Homebrew
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Other GUI apps
cask "balenaetcher"
cask "calibre"
cask "dropbox"
cask "epichrome"
cask "etrecheckpro"
cask "firefox"
cask "freemind"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-drive-file-stream"
cask "marshallofsound-google-play-music-player"
cask "gpg-suite"
cask "grandperspective"
cask "hammerspoon"
cask "imageoptim"
cask "inkscape"
cask "karabiner-elements"
cask "keybase"
cask "keycue"
cask "launchcontrol"
cask "libreoffice"
cask "nvalt"
cask "quicksilver"
cask "rowanj-gitx"
cask "setapp"
cask "signal"
cask "skyfonts"
cask "skype"
cask "slack"
cask "steam"
cask "suspicious-package"
cask "tor-browser"
cask "transmission"
cask "typinator"
cask "ubersicht"
cask "unison"
cask "viscosity"
cask "vlc"
cask "xquartz"
cask "yed"
cask "yt-music"

# Other
cask "logitech-unifying"
cask "onyx"

# GUI apps from Mac App Store
mas "1Password",                      id: 1333542190
mas "AVG Cleaner",                    id: 667434228
mas "Calca",                          id: 635758264
mas "Contacts Sync For Google Gmail", id: 451691288
mas "Deliveries",                     id: 924726344
mas "Evernote",                       id: 406056744
mas "Gapplin",                        id: 768053424
mas "GarageBand",                     id: 682658836
mas "Growl",                          id: 467939042
mas "Icon Slate",                     id: 439697913
mas "iMovie",                         id: 408981434
mas "Keynote",                        id: 409183694
mas "Kindle",                         id: 405399194
mas "LG Screen Manager",              id: 1142051783
mas "Lights Switch",                  id: 1181873676
mas "Numbers",                        id: 409203825
mas "Pages",                          id: 409201541
mas "Pixelmator Pro",                 id: 1289583905
mas "Singlemizer",                    id: 410263119
mas "Slack",                          id: 803453959
mas "The Unarchiver",                 id: 425424353
mas "Typeeto",                        id: 970502923
